#include <stdio.h>

int main() {
    int score_int = 90.5;     
    printf("score(int)  : %d\n", score_int);

    float score_float = 90.5;
    printf("score(foat) : %.1f\n", score_float); 

    return 0;
}
/*
1.ผลลัพธ์ที่ได้ต่างกันอย่างไร?
   - กรณีใช้ int: ค่า 90.5 จะถูกปัดเศษเป็นจำนวนเต็ม 90 (ไม่สามารถแสดงทศนิยมได้)
   - กรณีใช้ float: ค่า 90.5 จะแสดงผลเป็นทศนิยม 90.5 ได้อย่างครบถ้วน
2.ทำไมจต้อเงลือก Data Type ให้ถูกต้อง?
   - เนื่องจาก int ใช้สำหรับเก็บค่าจำนวนเต็มเท่านั้น ไม่สามารถเก็บค่าทศนิยมได้ 
   ในขณะที่ float สามารถเก็บค่าทศนิยมได้ หากเลือกผิดอาจเกิดการสูญเสียข้อมูล
   เช่น ทศนิยมหาย หรือค่าถูกปัดเศษ ทำให้ผลลัพธ์ไม่ถูกต้อง
3.อภิปราย และสรุปผลที่ได้จากการทดลอง:
   - การเลือก Data Type ที่เหมาะสมมีความสำคัญมากในการเขียนโปรแกรม 
   เพราะจะส่งผลต่อความถูกต้องของข้อมูลที่เก็บและแสดงผล การใช้ int กับค่าทศนิยจะทำให้
   ค่าทศนิยมถูกตัดทิ้งโดยอัตโนมัติ ในขณะที่หากต้องการเก็บค่าทศนิยมต้องใช้ float or double แทน
*/